### **დაწყებითი დონის დავალებები**

# 1. **დაბეჭდეთ "გამარჯობა, მსოფლიო!" ტექსტი.**
#    - გამოიყენეთ ფუნქცია, რომელიც ტექსტს პირდაპირ კონსოლში გამოყოფს.
def hello_world():
    print("გამარჯობა, მსოფლიო!")



# 2. **შეიყვანეთ სახელი და დაბეჭდეთ მისალმება.**
#    - ტექსტის შეყვანისთვის გამოიყენეთ შესაბამისი ფუნქცია და ჩასვით სახელი მისალმებაში.
name = input("your name:")
print("hello", name)

# ფუნქცია:
def hello(name):
    print("hello", name)



# 3. **გამოთვალეთ ორი რიცხვის ჯამი.**
#    - გადაყვანეთ მომხმარებლის შეყვანილი ტექსტი რიცხვებად და დაამატეთ ერთმანეთს.
num1 = int(input("number:"))
num2 = int(input("number:"))
print(num1 + num2)

# ფუნქცია
def adding_numbers(num1, num2):
    return num1 + num2



# 4. **შეამოწმეთ, არის თუ არა რიცხვი ლუწი თუ კენტი.**
#    - გაარკვიეთ, თუ რიცხვი იყოფა 2-ზე ნაშთის გარეშე.
num = int(input())
if num % 2 == 0:
    print("even")
else:
    print("odd")

# ფუნქცია
def even_odd(num):
    if num % 2 == 0:
        return "even"
    else:
        return "odd"



# 5. **დაამატეთ ასაკი და გამოთვალეთ ორმაგი ასაკი.**
#    - ასაკი შეინახეთ ცვლადში და გაზარდეთ ორჯერ.
age = int(input("your age:"))
print(age * 2)

# ფუნქცია
def double_age(age):
    return age * 2




# 6. **იპოვეთ რიცხვის კვადრატი.**
#    - გამოიყენეთ შესაბამისი მათემატიკური ოპერატორი კვადრატის მისაღებად.
#არ ვიცი კვადრატი რა არის



# 7. **გადააკეთეთ ცელსიუსი ფარენჰაიტად.**
#    - გამოიყენეთ მოცემული ფორმულა და შესაბამისი ოპერატორები.




# 8. **შექმენით სია საყვარელი ფილმებით.**
#    - გამოიყენეთ Python-ის "სიის" მონაცემთა ტიპი და დაამატეთ 5 ელემენტი.
favourite_films = ["dont watch films", "dont watch films", "dont watch films", "dont watch films", "dont watch films"]



# 9. **დაბეჭდეთ 1-დან 10-მდე რიცხვები.**
#    - გამოიყენეთ "for" ან "while" ციკლი რიცხვების ბეჭდვისთვის.
for i in range(10):
    print(i)



# 10. **გამოთვალეთ რიცხვების ჯამი სიიდან.**
#     - გადაუვლეთ სიას ციკლით და მიამატეთ ელემენტები.
list = [1, 2, 3, 4, 5]
sum = 0
for i in list:
    sum += i
print(sum)
